assets/s13-251-p1.org
#+TITLE: Solution Sketch
#+AUTHOR: Sean Allred
#+DATE: [2013-02-02 Sat]

* Disclaimer
I'm a fallible human being.
* The Assignment
:PROPERTIES:
:ID: 8B23EA1A-AE81-44EA-8473-325E33D2CBD9
:END:
*Objective:* Create the core of the current programming paradigm --
objects!

*Your Task:* In C (not C++!), you will be creating the functionality
to implement objects, thus retracing the steps of computer scientists
of 30 years ago.

Specifically, I would like you to create the ability to implement a
class like we do in C++. Note, that I'm not expecting you to do
everything that C++ can do with a class, but I am expecting you to be
able to show me some code that represents the baseline aspects of
class structures: fields/variables and functions.  The more
functionality that you can bring to the table, the higher your grade.
As a summary:

- To get an 85 :: A "class" that includes fields and functions; a
                  piece of demonstration code with a full class
                  implementation of something simple (Rectangle,
                  Student, etc.).
- To get a 90 :: Add "instantiation".  This would include multiple
                 constructors.  An extra 5 points if you handle
                 multiple constructors as functions with the same name
                 but different number of parameters.
- To get a 100 :: Add "object" variables to classes.  This will
                  require you to create two classes, and have one
                  inside of the other (for instance a Point object
                  inside of a Shape class).
- To get a 110 :: Add public and private scope
- To get a 120 :: Add inheritance. (no hints from the instructor or
                  TAs here)

Some quick hints: you are going to need to leverage both structs and
function pointers for this project.  This project is challenging, do
not put it off!  You do not need to be able to mimic the syntax of C++
classes, just the functionality.

*Deliverables:* your source code and a one-page writeup of the
 approach that you've taken for your solution.

*Learning Targets:* struct usage, pointer manipulation, C usage,
 origin of the object-oriented paradigm.

*Expectation:* The code should be clean, concise, well-commented, and
correct.  If you use an outside source, be sure to document that
source.  Significant use of outside sources will result in a
deduction.  Grading rubric will be provided a week ahead of the due
date.  You may work in pairs for this project -- your partner may be
in your section of in the other 251 section.  Teammate selection
emails due 1 February by 5pm.

*DUE:* February 17th, 11:59pm via Blackboard.
* Introduction
What are the main ideas of object-orientism?
- Modularity :: make it a complete package
- Reusability :: never write the same thing twice!
- Encapsulation :: a class is a complete thought

What do each of these mean?  To be /modular/ is to be portable -- the
code written can be lifted, taken elsewhere, and should still work the
same (barring technical details).  This does not preclude packages
with dependencies, but such dependencies should be reasonable and by
no means restrictive.

To be /reusable/ is similar to being modular, but code reusability
implies that you won't (manually) duplicate functionality elsewhere in
the project, i.e. /inheritance/.

To be /encapsulated/ is to be complete and careful.  Members that
should be private, such as number of extant Persons, should be made so
(or perhaps read-only to the outside world).  Members that should only
be available to `friends' should be made so.  Likewise with public
members.  Give only enough information to offer the full range of
motion for your class -- nothing more, nothing less.

But how can we implement these things using only the low-level
constructs available to us in K&R C?  To understand how to do that, we
need to delve a little deeper into how a program written in C runs.

The rest of this document will assume that you already have a basic
working knowledge about C.  Several topics are of paramount
importance:

- variables and variable declaration
- basic arithmetical operators
- a complete understanding of the control constructs =if=, =while=,
  and =for=
- function declaration and use
- structs
- type casting
- multiple-source programs (the separation of header from source)
- programming the C preprocessor (=#define=, =#undef=, =#if=,
  =#ifdef=, =#endif=)

and the following are /highly recommended/:

- /all/ of the C preprocessor directives
- use of =assert()=
- =typedef=
- =static=, =const=, and /all/ of the different types (there aren't
  that many -- look for patterns)

All of these topic (and others) are discussed in depth at [[http://www.acm.uiuc.edu/webmonkeys/book/c_guide/][the C
Library Reference Guide]] and at [[http://www.cplusplus.com/reference/][the C++ Reference Guide]], both of which
are worth skimming through at least once.

The rest of this document attempts to explain pointers, memory
management, and object-oriented techniques in a practical and
easy-to-understand, easy-to-reference manner.  If you have /any/
questions on the material below, please do not hesitate to contact me
via Facebook.  Who knows?  You might even get another hint out of me.

*Important:* If you would like me to release the materials (in BCPL)
upon which this project was based, like the status of mine that shared
it with you no later than [2013-02-13 Wed].  If more than half the
roster likes the status, I will promptly release it on this page.

I would like to take this time to personally apologize for this
project.

Oh!  And don't forget to give Marissa a hard time -- this is all her
fault somehow.
* A Simple Snippet
:PROPERTIES:
:ID: 2FD56A76-09C4-4FB7-9D8A-2BE969A95D52
:END:
*Disclaimer:* I don't actually know all this for absolute certain.
All of this will, of course, depend on the compiler you use.  However,
the general concepts should be consistent whichever compiler you
choose to utilize.  For reference, I've gathered this information
based purely on inferences garnered from the hex-explorer of programs
being debugged with =gdb=.  With that settled, I'm assuming that you
know the very basics of computer memory, so I'm not going to go over
that.  Let's take it from the top, going through a simple C program
that covers all of the necessary points.
