assets/s13-251-p1.org.html
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<!-- Created by htmlize-1.47 in css mode. -->
<html>
  <head>
    <title>s13-251-p1.org</title>
  </head>
  <body>
    <pre>
<span class="org-document-info-keyword">#+TITLE:</span> <span class="org-document-title">Solution Sketch
</span><span class="org-document-info-keyword">#+AUTHOR:</span> <span class="org-document-info">Sean Allred
</span><span class="org-document-info-keyword">#+DATE:</span> <span class="org-document-info">[2013-02-02 Sat]
</span>
<span class="org-level-1">* Disclaimer</span>
I'm a fallible human being.
<span class="org-level-1">* The Assignment</span>
<span class="org-special-keyword">:PROPERTIES:</span>
<span class="org-special-keyword">:ID:</span> <span class="org-property-value">8B23EA1A-AE81-44EA-8473-325E33D2CBD9</span>
<span class="org-special-keyword">:END:</span>
<span class="bold">*Objective:*</span> Create the core of the current programming paradigm --
objects!

<span class="bold">*Your Task:*</span> In C (not C++!), you will be creating the functionality
to implement objects, thus retracing the steps of computer scientists
of 30 years ago.

Specifically, I would like you to create the ability to implement a
class like we do in C++. Note, that I'm not expecting you to do
everything that C++ can do with a class, but I am expecting you to be
able to show me some code that represents the baseline aspects of
class structures: fields/variables and functions.  The more
functionality that you can bring to the table, the higher your grade.
As a summary:

- <span class="org-list-dt">To get an 85 ::</span> A "class" that includes fields and functions; a
                  piece of demonstration code with a full class
                  implementation of something simple (Rectangle,
                  Student, etc.).
- <span class="org-list-dt">To get a 90 ::</span> Add "instantiation".  This would include multiple
                 constructors.  An extra 5 points if you handle
                 multiple constructors as functions with the same name
                 but different number of parameters.
- <span class="org-list-dt">To get a 100 ::</span> Add "object" variables to classes.  This will
                  require you to create two classes, and have one
                  inside of the other (for instance a Point object
                  inside of a Shape class).
- <span class="org-list-dt">To get a 110 ::</span> Add public and private scope
- <span class="org-list-dt">To get a 120 ::</span> Add inheritance. (no hints from the instructor or
                  TAs here)

Some quick hints: you are going to need to leverage both structs and
function pointers for this project.  This project is challenging, do
not put it off!  You do not need to be able to mimic the syntax of C++
classes, just the functionality.

<span class="bold">*Deliverables:*</span> your source code and a one-page writeup of the
 approach that you've taken for your solution.

<span class="bold">*Learning Targets:*</span> struct usage, pointer manipulation, C usage,
 origin of the object-oriented paradigm.

<span class="bold">*Expectation:*</span> The code should be clean, concise, well-commented, and
correct.  If you use an outside source, be sure to document that
source.  Significant use of outside sources will result in a
deduction.  Grading rubric will be provided a week ahead of the due
date.  You may work in pairs for this project -- your partner may be
in your section of in the other 251 section.  Teammate selection
emails due 1 February by 5pm.

<span class="bold">*DUE:*</span> February 17th, 11:59pm via Blackboard.
<span class="org-level-1">* Introduction</span>
What are the main ideas of object-orientism?
- <span class="org-list-dt">Modularity ::</span> make it a complete package
- <span class="org-list-dt">Reusability ::</span> never write the same thing twice!
- <span class="org-list-dt">Encapsulation ::</span> a class is a complete thought

What do each of these mean?  To be <span class="italic">/modular/</span> is to be portable -- the
code written can be lifted, taken elsewhere, and should still work the
same (barring technical details).  This does not preclude packages
with dependencies, but such dependencies should be reasonable and by
no means restrictive.

To be <span class="italic">/reusable/</span> is similar to being modular, but code reusability
implies that you won't (manually) duplicate functionality elsewhere in
the project, i.e. <span class="italic">/inheritance/</span>.

To be <span class="italic">/encapsulated/</span> is to be complete and careful.  Members that
should be private, such as number of extant Persons, should be made so
(or perhaps read-only to the outside world).  Members that should only
be available to `friends' should be made so.  Likewise with public
members.  Give only enough information to offer the full range of
motion for your class -- nothing more, nothing less.

But how can we implement these things using only the low-level
constructs available to us in K&amp;R C?  To understand how to do that, we
need to delve a little deeper into how a program written in C runs.

The rest of this document will assume that you already have a basic
working knowledge about C.  Several topics are of paramount
importance:

- variables and variable declaration
- basic arithmetical operators
- a complete understanding of the control constructs <span class="org-verbatim">=if=</span>, <span class="org-verbatim">=while=</span>,
  and <span class="org-verbatim">=for=</span>
- function declaration and use
- structs
- type casting
- multiple-source programs (the separation of header from source)
- programming the C preprocessor (<span class="org-verbatim">=#define=</span>, <span class="org-verbatim">=#undef=</span>, <span class="org-verbatim">=#if=</span>,
  <span class="org-verbatim">=#ifdef=</span>, <span class="org-verbatim">=#endif=</span>)

and the following are <span class="italic">/highly recommended/</span>:

- <span class="italic">/all/</span> of the C preprocessor directives
- use of <span class="org-verbatim">=assert()=</span>
- <span class="org-verbatim">=typedef=</span>
- <span class="org-verbatim">=static=</span>, <span class="org-verbatim">=const=</span>, and <span class="italic">/all/</span> of the different types (there aren't
  that many -- look for patterns)

All of these topic (and others) are discussed in depth at <span class="org-link"><a href="http://www.acm.uiuc.edu/webmonkeys/book/c_guide/">the C
Library Reference Guide</a></span> and at <span class="org-link"><a href="http://www.cplusplus.com/reference/">the C++ Reference Guide</a></span>, both of which
are worth skimming through at least once.

The rest of this document attempts to explain pointers, memory
management, and object-oriented techniques in a practical and
easy-to-understand, easy-to-reference manner.  If you have <span class="italic">/any/</span>
questions on the material below, please do not hesitate to contact me
via Facebook.  Who knows?  You might even get another hint out of me.

<span class="bold">*Important:*</span> If you would like me to release the materials (in BCPL)
upon which this project was based, like the status of mine that shared
it with you no later than <span class="org-date">[2013-02-13 Wed]</span>.  If more than half the
roster likes the status, I will promptly release it on this page.

I would like to take this time to personally apologize for this
project.

Oh!  And don't forget to give Marissa a hard time -- this is all her
fault somehow.
<span class="org-level-1">* A Simple Snippet</span>
<span class="org-special-keyword">:PROPERTIES:</span>
<span class="org-special-keyword">:ID:</span> <span class="org-property-value">2FD56A76-09C4-4FB7-9D8A-2BE969A95D52</span>
<span class="org-special-keyword">:END:</span>
<span class="bold">*Disclaimer:*</span> I don't actually know all this for absolute certain.
All of this will, of course, depend on the compiler you use.  However,
the general concepts should be consistent whichever compiler you
choose to utilize.  For reference, I've gathered this information
based purely on inferences garnered from the hex-explorer of programs
being debugged with <span class="org-verbatim">=gdb=</span>.  With that settled, I'm assuming that you
know the very basics of computer memory, so I'm not going to go over
that.  Let's take it from the top, going through a simple C program
that covers all of the necessary points.
<span class="org-level-2">** The Basics</span>
