assets/s13-251-p1.org
** The Basics
First, know that (for our purposes) there are essentially two
structures always present with a running program: a *symbols table*
and the *memory*.  The symbols table keeps a record of what is defined
and where it is, while the memory actually holds the defined data.
These both start out empty.  For the purposes of this document, these
two structures are going to be combined into one table:

#+CAPTION: /Memory/
#+ATTR_HTML: border="2" frame="border"
| Symbol        | Address Block                | Data |
|---------------+------------------------------+------|
| =some_symbol= | =0x12345678= -- =0x1234567C= |    0 |

Let's look at this program.

#+name: SIMPLE_C_PROGRAM
#+begin_src C -n -r
  #include <stdio.h>                               (ref:include)
  
  int square(int);                                 (ref:decl-square)
#+end_src

In [[(include)][the first line]], we see the familiar directive =#include=.  This
preprocessor directive simply pulls the file contents of =stdio.h=
(from the standard library) right into your source file.  These
declare the availability of functions, just as [[(decl-square)][line 3]] does.  I'm not
sure about what happens internally, but think of it as if you are
telling the C compiler, "I don't know what this function should do
yet, but it's going to look like /this/."  [[(decl-square)][Line 3]] is what is called a
*function prototype* -- it's a declaration of what a function looks
like as opposed to what it should do.  Specifically, it allows you to
use this function before you define what exactly it is.

This is a crucial concept for object-oriented C.  You do not have to
write the function out before you can use it, you merely have to
declare its proper use.  Note that this does not mean functions don't
have to be defined at run-time at the point of use.[fn:1] In other words,
all functions must be defined by the actual time they're called (not
when they're written, but when they're called).

Reviewing the memory table,

#+CAPTION: /Memory/
#+ATTR_HTML: border="2" frame="border"
| Symbol            | Address Block | Data |
|-------------------+---------------+------|
| =int square(int)= | =0xFF000000=  |      |


#+name: SIMPLE_C_PROGRAM
#+begin_src C +n -r
  int main(char *argc, char **argv) {              (ref:main)
    int x;                                         (ref:new-var)
    x = 4;                                         (ref:set-var)
    printf("My number is %d.\n", x);               (ref:retrieve)
#+end_src

The [[(main)][entry point of our program]] declares that the main function (what
is run when the program itself is run) takes two arguments: the number
of arguments and the arguments themselves.  We will cover exactly how
this information is transferred shortly.  The [[(new-var)][next line]] declares the
availability of a variable =x=.  At this point, our memory table looks
a bit cooler:

#+CAPTION: /Memory/
#+ATTR_HTML: border="2" frame="border"
| Symbol            | Address Block         | Data |
|-------------------+-----------------------+------|
| =int square(int)= | =0xFF000000= -- =0x?= |      |
| =x=               | =0x00000000=          |      |

Notice the memory address of =x= -- this is what is known as =NULL=.
A variable at =NULL= cannot be used.

[[(set-var)][After that]], we simply set =x='s value to =4=, and after that, [[(retrieve)][printf]]
retrieves the value of =x= and formats it on-screen as

#+BEGIN_EXAMPLE -n
My number is 4.

#+END_EXAMPLE

Notice that =\n= is the /new-line/ character; since it is
non-printing, this escape sequence denotes the presence of a new line.
Look up =printf= in the specification for a more in-depth discussion.
Let's take a look at our /Memory/ table now:

#+CAPTION: /Memory/
#+ATTR_HTML: border="2" frame="border"
| Symbol            | Address Block                | Data |
|-------------------+------------------------------+------|
| =int square(int)= | =0xFF000000= -- =0x?=        |      |
| =x=               | =0xABCDEF00= -- =0xABCDEF03= |    4 |

Besides the function (which we will address, pun intended), we have
one named variable =x=, and it's holding the value =4= at memory
address =0xABCDEF01=.  (Obviously, I'm the memory locations in this
document are somewhat contrived, but the core concepts are consistent;
it's their interrelations that are important.)
