assets/s13-251-p1.org.html
First, know that (for our purposes) there are essentially two
structures always present with a running program: a <span class="bold">*symbols table*</span>
and the <span class="bold">*memory*</span>.  The symbols table keeps a record of what is defined
and where it is, while the memory actually holds the defined data.
These both start out empty.  For the purposes of this document, these
two structures are going to be combined into one table:

<span class="org-meta-line">#+CAPTION: /Memory/</span>
<span class="org-meta-line">#+ATTR_HTML: border="2" frame="border"</span>
<span class="org-table">| Symbol        | Address Block                | Data |</span>
<span class="org-table">|---------------+------------------------------+------|</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=some_symbol=</span></span><span class="org-table"> | </span><span class="org-formula"><span class="org-verbatim">=0x12345678=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0x1234567C=</span></span><span class="org-formula"> </span><span class="org-table">|    0 |</span>

Let's look at this program.

<span class="org-meta-line">#+name: SIMPLE_C_PROGRAM</span>
<span class="org-block-begin-line">#+begin_src C -n -r
</span><span class="preprocessor"><span class="org-block-background">  #include</span></span><span class="org-block-background"> </span><span class="string"><span class="org-block-background">&lt;stdio.h&gt;</span></span><span class="org-block-background">                               (ref:include)
  
  </span><span class="type"><span class="org-block-background">int</span></span><span class="org-block-background"> </span><span class="function-name"><span class="org-block-background">square</span></span><span class="org-block-background">(</span><span class="type"><span class="org-block-background">int</span></span><span class="org-block-background">);                                 (ref:decl-square)
</span><span class="org-block-end-line">#+end_src
</span>
In <span class="org-link"><a href="(include)">the first line</a></span>, we see the familiar directive <span class="org-verbatim">=#include=</span>.  This
preprocessor directive simply pulls the file contents of <span class="org-verbatim">=stdio.h=</span>
(from the standard library) right into your source file.  These
declare the availability of functions, just as <span class="org-link"><a href="(decl-square)">line 3</a></span> does.  I'm not
sure about what happens internally, but think of it as if you are
telling the C compiler, "I don't know what this function should do
yet, but it's going to look like <span class="italic">/this/</span>."  <span class="org-link"><a href="(decl-square)">Line 3</a></span> is what is called a
<span class="bold">*function prototype*</span> -- it's a declaration of what a function looks
like as opposed to what it should do.  Specifically, it allows you to
use this function before you define what exactly it is.

This is a crucial concept for object-oriented C.  You do not have to
write the function out before you can use it, you merely have to
declare its proper use.  Note that this does not mean functions don't
have to be defined at run-time at the point of use.<span class="org-footnote">[fn:1]</span> In other words,
all functions must be defined by the actual time they're called (not
when they're written, but when they're called).

Reviewing the memory table,

<span class="org-meta-line">#+CAPTION: /Memory/</span>
<span class="org-meta-line">#+ATTR_HTML: border="2" frame="border"</span>
<span class="org-table">| Symbol            | Address Block | Data |</span>
<span class="org-table">|-------------------+---------------+------|</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=int square(int)=</span></span><span class="org-table"> | </span><span class="org-formula"><span class="org-verbatim">=0xFF000000=</span></span><span class="org-formula">  </span><span class="org-table">|      |</span>


<span class="org-meta-line">#+name: SIMPLE_C_PROGRAM</span>
<span class="org-block-begin-line">#+begin_src C +n -r
</span><span class="org-block-background">  </span><span class="type"><span class="org-block-background">int</span></span><span class="org-block-background"> </span><span class="function-name"><span class="org-block-background">main</span></span><span class="org-block-background">(</span><span class="type"><span class="org-block-background">char</span></span><span class="org-block-background"> *</span><span class="variable-name"><span class="org-block-background">argc</span></span><span class="org-block-background">, </span><span class="type"><span class="org-block-background">char</span></span><span class="org-block-background"> **</span><span class="variable-name"><span class="org-block-background">argv</span></span><span class="org-block-background">) {              (ref:main)
    </span><span class="type"><span class="org-block-background">int</span></span><span class="org-block-background"> </span><span class="variable-name"><span class="org-block-background">x</span></span><span class="org-block-background">;                                         (ref:new-var)
    x = 4;                                         (ref:set-var)
    printf(</span><span class="string"><span class="org-block-background">"My number is %d.\n"</span></span><span class="org-block-background">, x);               (ref:retrieve)
</span><span class="org-block-end-line">#+end_src
</span>
The <span class="org-link"><a href="(main)">entry point of our program</a></span> declares that the main function (what
is run when the program itself is run) takes two arguments: the number
of arguments and the arguments themselves.  We will cover exactly how
this information is transferred shortly.  The <span class="org-link"><a href="(new-var)">next line</a></span> declares the
availability of a variable <span class="org-verbatim">=x=</span>.  At this point, our memory table looks
a bit cooler:

<span class="org-meta-line">#+CAPTION: /Memory/</span>
<span class="org-meta-line">#+ATTR_HTML: border="2" frame="border"</span>
<span class="org-table">| Symbol            | Address Block         | Data |</span>
<span class="org-table">|-------------------+-----------------------+------|</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=int square(int)=</span></span><span class="org-table"> | </span><span class="org-formula"><span class="org-verbatim">=0xFF000000=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0x?=</span></span><span class="org-formula"> </span><span class="org-table">|      |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=x=</span></span><span class="org-table">               | </span><span class="org-formula"><span class="org-verbatim">=0x00000000=</span></span><span class="org-formula">          </span><span class="org-table">|      |</span>

Notice the memory address of <span class="org-verbatim">=x=</span> -- this is what is known as <span class="org-verbatim">=NULL=</span>.
A variable at <span class="org-verbatim">=NULL=</span> cannot be used.

<span class="org-link"><a href="(set-var)">After that</a></span>, we simply set <span class="org-verbatim">=x=</span>'s value to <span class="org-verbatim">=4=</span>, and after that, <span class="org-link"><a href="(retrieve)">printf</a></span>
retrieves the value of <span class="org-verbatim">=x=</span> and formats it on-screen as

<span class="org-block-begin-line">#+BEGIN_EXAMPLE -n
</span><span class="org-block-background">My number is 4.
</span><span class="org-meta-line"><span class="org-block-background">
</span></span><span class="org-block-end-line">#+END_EXAMPLE
</span>
Notice that <span class="org-verbatim">=\n=</span> is the <span class="italic">/new-line/</span> character; since it is
non-printing, this escape sequence denotes the presence of a new line.
Look up <span class="org-verbatim">=printf=</span> in the specification for a more in-depth discussion.
Let's take a look at our <span class="italic">/Memory/</span> table now:

<span class="org-meta-line">#+CAPTION: /Memory/</span>
<span class="org-meta-line">#+ATTR_HTML: border="2" frame="border"</span>
<span class="org-table">| Symbol            | Address Block                | Data |</span>
<span class="org-table">|-------------------+------------------------------+------|</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=int square(int)=</span></span><span class="org-table"> | </span><span class="org-formula"><span class="org-verbatim">=0xFF000000=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0x?=</span></span><span class="org-formula">        </span><span class="org-table">|      |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=x=</span></span><span class="org-table">               | </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF00=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF03=</span></span><span class="org-formula"> </span><span class="org-table">|    4 |</span>

Besides the function (which we will address, pun intended), we have
one named variable <span class="org-verbatim">=x=</span>, and it's holding the value <span class="org-verbatim">=4=</span> at memory
address <span class="org-verbatim">=0xABCDEF01=</span>.  (Obviously, I'm the memory locations in this
document are somewhat contrived, but the core concepts are consistent;
it's their interrelations that are important.)
<span class="org-level-2">** Pointers</span>
