assets/s13-251-p1.org
** Pointers
Now we come to the next major portion of our example program:

#+name: SIMPLE_C_PROGRAM
#+begin_src C +n -r
    int *x_pointer = &x;                           (ref:new-pointer)
#+end_src

It is here where we find the center of all of the power of C (and the
secret to its object-oriented application).  We [[(new-pointer)][declare]] an =int=
*pointer*.  (Dramatic pause.)

What is a pointer?  Why does it point?  Does it have any purpose in
existence?  Is its purpose solely to point its accusatory finger
forever aimlessly?  Funny names aside, a pointer is a special `type'
of variable.  It's a variation on the type, as it were.  To say I have
an =int= pointer[fn:2] is to say that I have some variable that contains
the /memory address of/ a variable of that type which it points to.

If this is your first time hearing about these `pointers,' you are
likely /very/ confused right now.  Don't worry -- I'll explain.  Let's
take another look at our /Memory/ table.  We have two variables now:

#+CAPTION: /Memory/
#+ATTR_HTML: border="2" frame="border"
| Symbol            | Address Block                | Data         |
|-------------------+------------------------------+--------------|
| =int square(int)= | =0xFF000000= -- =0x?=        |              |
|                   | =..........=                 |              |
| =x=               | =0xABCDEF00= -- =0xABCDEF03= | 4            |
|                   | =0xABCDEF04=                 |              |
|                   | =0xABCDEF08=                 |              |
|                   | =0xABCDEF0C=                 |              |
|                   | =..........=                 |              |
| =x_pointer=       | =0xAAAAAA00=                 | =0xABCDEF00= |
|                   | =..........=                 |              |

So what's happened here?  We've added another variable, =x_pointer=,
that holds the memory address of =x= (the value returned by =&x=) at
memory location =0xAAAAAA00=.  =&= is an unary (one-argument) operator
that gives the /memory address/ of its argument.  So, =&x= would
return the /memory address/ of our variable =x=.  We put this value in
=x_pointer=, a variable specifically set up to hold the memory address
of an integer.  Thus, the value of =x_pointer= is now =0xABCDEF00=,
the /memory address/ of =x=.

Continuing, note that even though =x_pointer= contains a special value
that we don't normally work with, C allows us to manipulate it.  This
is where the real fun begins.

C defines the following operations on /all/ pointers (where =T *p= is
some pointer of base-type =T=):

- =*p= :: Gets the data at the /memory address/ stored in =p=.
- =p + <int>= :: Returns a memory address such that there can lie
                 =<int>= variables of type =T= between =p= and the
                 returned address.  (Obviously, =+== and =-== work as
                 you'd then expect.)

These two operations define everything that can be done with
pointers (besides the address-of operator, =&=).
*** Double-Dipping
As an aside, what if I introduced another pointer =x_pointer2 = &x=?
It would point to =x= just as =x_pointer= does now.  If I so chose, I
could manipulate =x= using both =x_pointer= and =x_pointer2= without
worrying about which one I was using (so long as they both maintained
equal values).  They point to the same address.  Whatever I do to =x=
using =x_pointer= will be reflected when I look at =x= using
=x_pointer2=.

This is important to understand.  As an analogy, let's say you went
out and got a P.O. box today and started receiving mail there.  Even
though your P.O. box address isn't the same as your home address, they
still send mail to the same person.  So it is with pointers: even
though the pointers may have different names, all that matters in most
cases is what they point to.  Anything mailed to =x= using =x_pointer=
might as well have come from =x_pointer2= -- they refer to the same
=x=.
