assets/s13-251-p1.org.html
Now we come to the next major portion of our example program:

<span class="org-meta-line">#+name: SIMPLE_C_PROGRAM</span>
<span class="org-block-begin-line">#+begin_src C +n -r
</span><span class="org-block-background">    </span><span class="type"><span class="org-block-background">int</span></span><span class="org-block-background"> *</span><span class="variable-name"><span class="org-block-background">x_pointer</span></span><span class="org-block-background"> = &amp;x;                           (ref:new-pointer)
</span><span class="org-block-end-line">#+end_src
</span>
It is here where we find the center of all of the power of C (and the
secret to its object-oriented application).  We <span class="org-link"><a href="(new-pointer)">declare</a></span> an <span class="org-verbatim">=int=</span>
<span class="bold">*pointer*</span>.  (Dramatic pause.)

What is a pointer?  Why does it point?  Does it have any purpose in
existence?  Is its purpose solely to point its accusatory finger
forever aimlessly?  Funny names aside, a pointer is a special `type'
of variable.  It's a variation on the type, as it were.  To say I have
an <span class="org-verbatim">=int=</span> pointer<span class="org-footnote">[fn:2]</span> is to say that I have some variable that contains
the <span class="italic">/memory address of/</span> a variable of that type which it points to.

If this is your first time hearing about these `pointers,' you are
likely <span class="italic">/very/</span> confused right now.  Don't worry -- I'll explain.  Let's
take another look at our <span class="italic">/Memory/</span> table.  We have two variables now:

<span class="org-meta-line">#+CAPTION: /Memory/</span>
<span class="org-meta-line">#+ATTR_HTML: border="2" frame="border"</span>
<span class="org-table">| Symbol            | Address Block                | Data         |</span>
<span class="org-table">|-------------------+------------------------------+--------------|</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=int square(int)=</span></span><span class="org-table"> | </span><span class="org-formula"><span class="org-verbatim">=0xFF000000=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0x?=</span></span><span class="org-formula">        </span><span class="org-table">|              |</span>
<span class="org-table">|                   | </span><span class="org-formula"><span class="org-verbatim">=..........=</span></span><span class="org-formula">                 </span><span class="org-table">|              |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=x=</span></span><span class="org-table">               | </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF00=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF03=</span></span><span class="org-formula"> </span><span class="org-table">| 4            |</span>
<span class="org-table">|                   | </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF04=</span></span><span class="org-formula">                 </span><span class="org-table">|              |</span>
<span class="org-table">|                   | </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF08=</span></span><span class="org-formula">                 </span><span class="org-table">|              |</span>
<span class="org-table">|                   | </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF0C=</span></span><span class="org-formula">                 </span><span class="org-table">|              |</span>
<span class="org-table">|                   | </span><span class="org-formula"><span class="org-verbatim">=..........=</span></span><span class="org-formula">                 </span><span class="org-table">|              |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=x_pointer=</span></span><span class="org-table">       | </span><span class="org-formula"><span class="org-verbatim">=0xAAAAAA00=</span></span><span class="org-formula">                 </span><span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=0xABCDEF00=</span></span><span class="org-table"> |</span>
<span class="org-table">|                   | </span><span class="org-formula"><span class="org-verbatim">=..........=</span></span><span class="org-formula">                 </span><span class="org-table">|              |</span>

So what's happened here?  We've added another variable, <span class="org-verbatim">=x_pointer=</span>,
that holds the memory address of <span class="org-verbatim">=x=</span> (the value returned by <span class="org-verbatim">=&amp;x=</span>) at
memory location <span class="org-verbatim">=0xAAAAAA00=</span>.  <span class="org-verbatim">=&amp;=</span> is an unary (one-argument) operator
that gives the <span class="italic">/memory address/</span> of its argument.  So, <span class="org-verbatim">=&amp;x=</span> would
return the <span class="italic">/memory address/</span> of our variable <span class="org-verbatim">=x=</span>.  We put this value in
<span class="org-verbatim">=x_pointer=</span>, a variable specifically set up to hold the memory address
of an integer.  Thus, the value of <span class="org-verbatim">=x_pointer=</span> is now <span class="org-verbatim">=0xABCDEF00=</span>,
the <span class="italic">/memory address/</span> of <span class="org-verbatim">=x=</span>.

Continuing, note that even though <span class="org-verbatim">=x_pointer=</span> contains a special value
that we don't normally work with, C allows us to manipulate it.  This
is where the real fun begins.

C defines the following operations on <span class="italic">/all/</span> pointers (where <span class="org-verbatim">=T *p=</span> is
some pointer of base-type <span class="org-verbatim">=T=</span>):

- <span class="org-verbatim"><span class="org-list-dt">=*p=</span></span><span class="org-list-dt"> ::</span> Gets the data at the <span class="italic">/memory address/</span> stored in <span class="org-verbatim">=p=</span>.
- <span class="org-verbatim"><span class="org-list-dt">=p + &lt;int&gt;=</span></span><span class="org-list-dt"> ::</span> Returns a memory address such that there can lie
                 <span class="org-verbatim">=&lt;int&gt;=</span> variables of type <span class="org-verbatim">=T=</span> between <span class="org-verbatim">=p=</span> and the
                 returned address.  (Obviously, <span class="org-verbatim">=+==</span> and <span class="org-verbatim">=-==</span> work as
                 you'd then expect.)

These two operations define everything that can be done with
pointers (besides the address-of operator, <span class="org-verbatim">=&amp;=</span>).
<span class="org-level-3">*** Double-Dipping</span>
As an aside, what if I introduced another pointer <span class="org-verbatim">=x_pointer2 = &amp;x=</span>?
It would point to <span class="org-verbatim">=x=</span> just as <span class="org-verbatim">=x_pointer=</span> does now.  If I so chose, I
could manipulate <span class="org-verbatim">=x=</span> using both <span class="org-verbatim">=x_pointer=</span> and <span class="org-verbatim">=x_pointer2=</span> without
worrying about which one I was using (so long as they both maintained
equal values).  They point to the same address.  Whatever I do to <span class="org-verbatim">=x=</span>
using <span class="org-verbatim">=x_pointer=</span> will be reflected when I look at <span class="org-verbatim">=x=</span> using
<span class="org-verbatim">=x_pointer2=</span>.

This is important to understand.  As an analogy, let's say you went
out and got a P.O. box today and started receiving mail there.  Even
though your P.O. box address isn't the same as your home address, they
still send mail to the same person.  So it is with pointers: even
though the pointers may have different names, all that matters in most
cases is what they point to.  Anything mailed to <span class="org-verbatim">=x=</span> using <span class="org-verbatim">=x_pointer=</span>
might as well have come from <span class="org-verbatim">=x_pointer2=</span> -- they refer to the same
<span class="org-verbatim">=x=</span>.
<span class="org-level-2">** Indirection</span>
<span class="org-meta-line">#+name: SIMPLE_C_PROGRAM</span>
<span class="org-block-begin-line">#+begin_src C +n -r
