assets/s13-251-p1.org
** Indirection
#+name: SIMPLE_C_PROGRAM
#+begin_src C +n -r
     x_pointer += 1;                               (ref:incr-pointer)
#+end_src

Quickly now, the memory table looks something like this:

#+CAPTION: /Memory/
#+ATTR_HTML: border="2" frame="border"
| Symbol            | Address Block                | Data         |
|-------------------+------------------------------+--------------|
| =int square(int)= | =0xFF000000= -- =0x?=        |              |
| =x=               | =0xABCDEF00= -- =0xABCDEF03= | 4            |
|                   | =0xABCDEF04= -- =0xABCDEF07= |              |
|                   | =0xABCDEF08= -- =0xABCDEF0B= |              |
|                   | ............................ |              |
| =x_pointer=       | =0xBACDEF00= -- =0xBACDEF03= | =0xABCDEF00= |

Notice that =x_pointer= has indeed assumed the address of =x=.  When
we [[(incr-pointer)][increment the pointer]], we advance the address it holds such that
exactly one integer's worth of memory lies between its old value and
its new value, like so:

#+CAPTION: /Memory/
#+ATTR_HTML: border="2" frame="border"
| Symbol            | Address Block                | Data         |
|-------------------+------------------------------+--------------|
| =int square(int)= | =0xFF000000= -- =0x?=        |              |
| =x=               | =0xABCDEF00= -- =0xABCDEF03= | 4            |
|                   | =0xABCDEF04= -- =0xABCDEF07= |              |
|                   | =0xABCDEF08= -- =0xABCDEF11= |              |
|                   | ............................ |              |
| =x_pointer=       | =0xBACDEF00= -- =0xBACDEF03= | =0xABCDEF04= |

#+name: SIMPLE_C_PROGRAM
#+begin_src C +n -r
    *x_pointer  = 12;                              (ref:dereference)
#+end_src

Then, when we [[(dereference)][dereference]] =x_pointer= at its new value, we are given
/the next `integer-slot' available/ after =x=.  When we set it to
=12=, something /amazing/ happens: (to be read in the voice of the
little boy from /The Incredibles/)

#+CAPTION: /Memory/
#+ATTR_HTML: border="2" frame="border"
| Symbol            | Address Block                |         Data |
|-------------------+------------------------------+--------------|
| =int square(int)= | =0xFF000000= -- =0x?=        |              |
| =x=               | =0xABCDEF00= -- =0xABCDEF03= |            4 |
|                   | =0xABCDEF04= -- =0xABCDEF07= |           12 |
|                   | =0xABCDEF08= -- =0xABCDEF0B= |              |
|                   | ............................ |              |
| =x_pointer=       | =0xBACDEF00= -- =0xBACDEF03= | =0xABCDEF04= |

We have /indirectly/ set the value of a spot in memory without ever
giving it a name.  We never said =int x2= or anything of the sort; we
manipulated memory to achieve what we wanted.  This phenomenon is
called /indirection/, and manipulating memory like this is usually
called `using indirection.'  Since you don't have to explicitly
declare any variables, indirection is thus the foundation of both
using arrays and implementing dynamic arrays.
