assets/s13-251-p1.org.html
</span><span class="org-block-background">     x_pointer += 1;                               (ref:incr-pointer)
</span><span class="org-block-end-line">#+end_src
</span>
Quickly now, the memory table looks something like this:

<span class="org-meta-line">#+CAPTION: /Memory/</span>
<span class="org-meta-line">#+ATTR_HTML: border="2" frame="border"</span>
<span class="org-table">| Symbol            | Address Block                | Data         |</span>
<span class="org-table">|-------------------+------------------------------+--------------|</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=int square(int)=</span></span><span class="org-table"> | </span><span class="org-formula"><span class="org-verbatim">=0xFF000000=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0x?=</span></span><span class="org-formula">        </span><span class="org-table">|              |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=x=</span></span><span class="org-table">               | </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF00=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF03=</span></span><span class="org-formula"> </span><span class="org-table">| 4            |</span>
<span class="org-table">|                   | </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF04=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF07=</span></span><span class="org-formula"> </span><span class="org-table">|              |</span>
<span class="org-table">|                   | </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF08=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF0B=</span></span><span class="org-formula"> </span><span class="org-table">|              |</span>
<span class="org-table">|                   | ............................ |              |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=x_pointer=</span></span><span class="org-table">       | </span><span class="org-formula"><span class="org-verbatim">=0xBACDEF00=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0xBACDEF03=</span></span><span class="org-formula"> </span><span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=0xABCDEF00=</span></span><span class="org-table"> |</span>

Notice that <span class="org-verbatim">=x_pointer=</span> has indeed assumed the address of <span class="org-verbatim">=x=</span>.  When
we <span class="org-link"><a href="(incr-pointer)">increment the pointer</a></span>, we advance the address it holds such that
exactly one integer's worth of memory lies between its old value and
its new value, like so:

<span class="org-meta-line">#+CAPTION: /Memory/</span>
<span class="org-meta-line">#+ATTR_HTML: border="2" frame="border"</span>
<span class="org-table">| Symbol            | Address Block                | Data         |</span>
<span class="org-table">|-------------------+------------------------------+--------------|</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=int square(int)=</span></span><span class="org-table"> | </span><span class="org-formula"><span class="org-verbatim">=0xFF000000=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0x?=</span></span><span class="org-formula">        </span><span class="org-table">|              |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=x=</span></span><span class="org-table">               | </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF00=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF03=</span></span><span class="org-formula"> </span><span class="org-table">| 4            |</span>
<span class="org-table">|                   | </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF04=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF07=</span></span><span class="org-formula"> </span><span class="org-table">|              |</span>
<span class="org-table">|                   | </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF08=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF11=</span></span><span class="org-formula"> </span><span class="org-table">|              |</span>
<span class="org-table">|                   | ............................ |              |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=x_pointer=</span></span><span class="org-table">       | </span><span class="org-formula"><span class="org-verbatim">=0xBACDEF00=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0xBACDEF03=</span></span><span class="org-formula"> </span><span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=0xABCDEF04=</span></span><span class="org-table"> |</span>

<span class="org-meta-line">#+name: SIMPLE_C_PROGRAM</span>
<span class="org-block-begin-line">#+begin_src C +n -r
</span><span class="org-block-background">    *x_pointer  = 12;                              (ref:dereference)
</span><span class="org-block-end-line">#+end_src
</span>
Then, when we <span class="org-link"><a href="(dereference)">dereference</a></span> <span class="org-verbatim">=x_pointer=</span> at its new value, we are given
<span class="italic">/the next `integer-slot' available/</span> after <span class="org-verbatim">=x=</span>.  When we set it to
<span class="org-verbatim">=12=</span>, something <span class="italic">/amazing/</span> happens: (to be read in the voice of the
little boy from <span class="italic">/The Incredibles/</span>)

<span class="org-meta-line">#+CAPTION: /Memory/</span>
<span class="org-meta-line">#+ATTR_HTML: border="2" frame="border"</span>
<span class="org-table">| Symbol            | Address Block                |         Data |</span>
<span class="org-table">|-------------------+------------------------------+--------------|</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=int square(int)=</span></span><span class="org-table"> | </span><span class="org-formula"><span class="org-verbatim">=0xFF000000=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0x?=</span></span><span class="org-formula">        </span><span class="org-table">|              |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=x=</span></span><span class="org-table">               | </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF00=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF03=</span></span><span class="org-formula"> </span><span class="org-table">|            4 |</span>
<span class="org-table">|                   | </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF04=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF07=</span></span><span class="org-formula"> </span><span class="org-table">|           12 |</span>
<span class="org-table">|                   | </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF08=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF0B=</span></span><span class="org-formula"> </span><span class="org-table">|              |</span>
<span class="org-table">|                   | ............................ |              |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=x_pointer=</span></span><span class="org-table">       | </span><span class="org-formula"><span class="org-verbatim">=0xBACDEF00=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0xBACDEF03=</span></span><span class="org-formula"> </span><span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=0xABCDEF04=</span></span><span class="org-table"> |</span>

We have <span class="italic">/indirectly/</span> set the value of a spot in memory without ever
giving it a name.  We never said <span class="org-verbatim">=int x2=</span> or anything of the sort; we
manipulated memory to achieve what we wanted.  This phenomenon is
called <span class="italic">/indirection/</span>, and manipulating memory like this is usually
called `using indirection.'  Since you don't have to explicitly
declare any variables, indirection is thus the foundation of both
using arrays and implementing dynamic arrays.
<span class="org-level-2">** Function Pointers</span>
Going forward,

<span class="org-meta-line">#+name: SIMPLE_C_PROGRAM</span>
<span class="org-block-begin-line">#+begin_src C +n -r
