assets/s13-251-p1.org
** Function Pointers
Going forward,

#+name: SIMPLE_C_PROGRAM
#+begin_src C +n -r
     x_pointer = &x;                               (ref:reset-pointer)
     int (*function_pointer)(int);                 (ref:func_pointer)
     function_pointer = &square;                   (ref:assign-fptr)
    *(x_pointer + 2) = function_pointer(x);        (ref:array-intr)
#+end_src

We effectively `[[(reset-pointer)][reset]]' the value of =x_pointer= so that it points back
to =x= (you can also say =x_pointer--;= in this particular case).
Then, something /even more amazing/ happens: we [[(func_pointer)][declare]] a /function
pointer/.  Functions pointers are, in essence, just like normal
pointers, although they are a bit different in their use.  I'm not
sure what would happen if you were to increment a function pointer.
I'm not sure what would happen if you tried to dereference one.
Function pointers yet have their use.  Once `bound' to a function (as
=function_pointer= is [[(assign-fptr)][bound to =square=]]), the pointer can be used just
as a normal function, as seen on the [[(array-intr)][next line]].  It is important to
note also on [[(array-intr)][that line]] the `shorthand' for working with pointers as
arrays.  Can you guess what it did?

#+CAPTION: /Memory/
#+ATTR_HTML: border="2" frame="border"
| Symbol             | Address Block                |         Data |
|--------------------+------------------------------+--------------|
| =int square(int)=  | =0xFF000000= -- =0x?=        |              |
|                    | =..........=                 |              |
| =x=                | =0xABCDEF00= -- =0xABCDEF03= |            4 |
|                    | =0xABCDEF04= -- =0xABCDEF07= |           12 |
|                    | =0xABCDEF08= -- =0xABCDEF0B= |           16 |
|                    | =0xABCDEF0C= -- =0xABCDEF0F= |              |
|                    | =..........=                 |              |
| =x_pointer=        | =0xAAAAAA00=                 | =0xABCDEF00= |
|                    | =..........=                 |              |
| =function_pointer= | =0xBBBBBB00=                 | =0xFF000000= |
|                    | =..........=                 |              |

Thus, using [[(array-intr)][=function\_pointer=]] was the same as using [[(assign-fptr)][=square=]], and
referred to the same function in memory.  The resultant value (16) was
stored two =int=-spaces from =x_pointer= (=x_pointer + 2=), whose
value contained the address of =x=.  As we know, however, there is a
far easier way of expressing the form =*(p + i)=.  After a lengthy
debate with [[http://faculty.smcm.edu/sread/][Dr. Simon Read]] (who had to consult his resources),
=p[i]= := =*(p + i)=.
