assets/s13-251-p1.org.html
</span><span class="org-block-background">     x_pointer = &amp;x;                               (ref:reset-pointer)
     </span><span class="type"><span class="org-block-background">int</span></span><span class="org-block-background"> (*</span><span class="function-name"><span class="org-block-background">function_pointer</span></span><span class="org-block-background">)(</span><span class="type"><span class="org-block-background">int</span></span><span class="org-block-background">);                 (ref:func_pointer)
     function_pointer = &amp;square;                   (ref:assign-fptr)
    *(x_pointer + 2) = function_pointer(x);        (ref:array-intr)
</span><span class="org-block-end-line">#+end_src
</span>
We effectively `<span class="org-link"><a href="(reset-pointer)">reset</a></span>' the value of <span class="org-verbatim">=x_pointer=</span> so that it points back
to <span class="org-verbatim">=x=</span> (you can also say <span class="org-verbatim">=x_pointer--;=</span> in this particular case).
Then, something <span class="italic">/even more amazing/</span> happens: we <span class="org-link"><a href="(func_pointer)">declare</a></span> a <span class="italic">/function
pointer/</span>.  Functions pointers are, in essence, just like normal
pointers, although they are a bit different in their use.  I'm not
sure what would happen if you were to increment a function pointer.
I'm not sure what would happen if you tried to dereference one.
Function pointers yet have their use.  Once `bound' to a function (as
<span class="org-verbatim">=function_pointer=</span> is <span class="org-link"><a href="(assign-fptr)">bound to =square=</a></span>), the pointer can be used just
as a normal function, as seen on the <span class="org-link"><a href="(array-intr)">next line</a></span>.  It is important to
note also on <span class="org-link"><a href="(array-intr)">that line</a></span> the `shorthand' for working with pointers as
arrays.  Can you guess what it did?

<span class="org-meta-line">#+CAPTION: /Memory/</span>
<span class="org-meta-line">#+ATTR_HTML: border="2" frame="border"</span>
<span class="org-table">| Symbol             | Address Block                |         Data |</span>
<span class="org-table">|--------------------+------------------------------+--------------|</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=int square(int)=</span></span><span class="org-table">  | </span><span class="org-formula"><span class="org-verbatim">=0xFF000000=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0x?=</span></span><span class="org-formula">        </span><span class="org-table">|              |</span>
<span class="org-table">|                    | </span><span class="org-formula"><span class="org-verbatim">=..........=</span></span><span class="org-formula">                 </span><span class="org-table">|              |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=x=</span></span><span class="org-table">                | </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF00=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF03=</span></span><span class="org-formula"> </span><span class="org-table">|            4 |</span>
<span class="org-table">|                    | </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF04=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF07=</span></span><span class="org-formula"> </span><span class="org-table">|           12 |</span>
<span class="org-table">|                    | </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF08=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF0B=</span></span><span class="org-formula"> </span><span class="org-table">|           16 |</span>
<span class="org-table">|                    | </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF0C=</span></span><span class="org-formula"> -- </span><span class="org-formula"><span class="org-verbatim">=0xABCDEF0F=</span></span><span class="org-formula"> </span><span class="org-table">|              |</span>
<span class="org-table">|                    | </span><span class="org-formula"><span class="org-verbatim">=..........=</span></span><span class="org-formula">                 </span><span class="org-table">|              |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=x_pointer=</span></span><span class="org-table">        | </span><span class="org-formula"><span class="org-verbatim">=0xAAAAAA00=</span></span><span class="org-formula">                 </span><span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=0xABCDEF00=</span></span><span class="org-table"> |</span>
<span class="org-table">|                    | </span><span class="org-formula"><span class="org-verbatim">=..........=</span></span><span class="org-formula">                 </span><span class="org-table">|              |</span>
<span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=function_pointer=</span></span><span class="org-table"> | </span><span class="org-formula"><span class="org-verbatim">=0xBBBBBB00=</span></span><span class="org-formula">                 </span><span class="org-table">| </span><span class="org-table"><span class="org-verbatim">=0xFF000000=</span></span><span class="org-table"> |</span>
<span class="org-table">|                    | </span><span class="org-formula"><span class="org-verbatim">=..........=</span></span><span class="org-formula">                 </span><span class="org-table">|              |</span>

Thus, using <span class="org-link"><a href="(array-intr)">=function\_pointer=</a></span> was the same as using <span class="org-link"><a href="(assign-fptr)">=square=</a></span>, and
referred to the same function in memory.  The resultant value (16) was
stored two <span class="org-verbatim">=int=</span>-spaces from <span class="org-verbatim">=x_pointer=</span> (<span class="org-verbatim">=x_pointer + 2=</span>), whose
value contained the address of <span class="org-verbatim">=x=</span>.  As we know, however, there is a
far easier way of expressing the form <span class="org-verbatim">=*(p + i)=</span>.  After a lengthy
debate with <span class="org-link"><a href="http://faculty.smcm.edu/sread/">Dr. Simon Read</a></span> (who had to consult his resources),
<span class="org-verbatim">=p[i]=</span> := <span class="org-verbatim">=*(p + i)=</span>.
