assets/s13-251-p1.org
** Arrays and Summary
By far the most common use of pointers is for /arrays/, so naturally
this use found its way into C syntax (use of the brackets is called
/array notation/).

So, pointers can be used simply as so, (note =%p= is a =printf= format
flag for addresses (/p/ is for /pointer/!)):

#+name: SIMPLE_C_PROGRAM
#+begin_src C +n -r
    for(int i = 0; i < 3; i++) {                   (ref:loop)
      printf("Address \"%p\" holds \"%d\".\n",     (ref:anal-mem)
              x_pointer + i, x_pointer[i]);        (ref:array-nota)
    }                                              (ref:end-loop)
#+end_src

This would print out as

#+begin_example
Address "0xABCDEF00" holds "4".
Address "0xABCDEF04" holds "12".
Address "0xABCDEF08" holds "16".
#+end_example

And thus, we have finished the guts of the program.  What follows are
the necessary statements needed to make this a valid C program.

#+name: SIMPLE_C_PROGRAM
#+begin_src C +n -r
    puts("All done.");                             (ref:final-print)
    return 0;
  }

  int square(int a) {                              (ref:defun-square)
    return a * a;
  }
#+end_src

And there you have it!  Remember everything you've learned so far;
it's important that you're comfortable with it before you can
implement what lies ahead...

- Functions and variables have memory addresses
- These addresses can be accessed using the address-of operator, =&=
- Addresses are stored in pointers
- You can get the value stored at an address using the dereferencing
  operator, =*=

Know what is going on in these statements (there is not necessarily
any coherence within them):

#+BEGIN_SRC C
int *p = &v;

char *s = malloc(7 * sizeof(char));

void (*fp)(void) = &hi;

s[0] = 'H';
s[1] = 'e';
s[2] = 'l';
s[3] = 'l';
s[4] = 'o';
s[5] = '!';
s[6] = '\0';
#+END_SRC

A few extra things to note for the above:

- =sizeof(T)= is a special function that takes a type (such as =int=
  or =struct MyStruct=) and returns a =sizet= (a size-type; basically
  an =unsigned int=) of how many bytes it takes to store a complete
  variable of that type.  On 32-bit systems, for example, =sizeof(int)
  = 4=.
- =malloc(sizet)= is a function (included in =stdlib.h=) that returns
  an address that marks the beginning of a block of free memory.  Use
  of this function is /always/ recommended, as it also protects the
  memory you ask for from being written over by another part of the
  program (it /allocates/ the /memory/ for you).
- Since there are no explicit bounds on `arrays' (since these are just
  pointers), there is no real way to `stop' an array.  Thus, since C
  strings are just arrays of characters, each string in C is ended by
  the null character, =\0=.  (C-strings are so-called
  /null-terminated/ strings.)

A complete reference for all of these functions can be found at [[http://www.cplusplus.com/reference/][the
C++ Reference Page]].  It is an excellent and highly recommended
resource.
* Object Orientism
You are just about ready to delve into object-oriented C.  From here
on out, there will be almost /no immediately relevant code/ (at least
until after the project is due).  C is a language that is not
immediately well-suited for object-oriented techniques, however, a
firm understanding of /exactly what object-orientism is/ will be
invaluable in your endeavors.  Let us begin.
** Objects?  What are Objects?
What /are/ objects?  Think back to your days of 120, where everything
was so simple and orderly.  You always knew exactly what was going to
happen at any given moment (or at least, looking back now you can).
Everything happened in order, exactly as you instructed.  You made
variables and =for= loops and =while= loops and all arrangements of
=if= statements, and you thought you reached the limits of what Java
could do.

This is pretty much what C is like at first glance.  While everything
can be done in the =main= function, it would be ugly and untenable --
impossible to manage or comprehend.  A lot of functionality would be
lost to you unless you /really/ knew what you were doing with those
`pointer' things up there.  But in Java, you didn't stop at the =main=
function; you went on to create other functions inside the same file.
You went on to put variables, free from any function, inside that file
as well.  /Then you even started using that entire file as a singly
entity from another file./
