assets/s13-251-p1.org.html
<span class="org-level-2">** Arrays and Summary</span>
By far the most common use of pointers is for <span class="italic">/arrays/</span>, so naturally
this use found its way into C syntax (use of the brackets is called
<span class="italic">/array notation/</span>).

So, pointers can be used simply as so, (note <span class="org-verbatim">=%p=</span> is a <span class="org-verbatim">=printf=</span> format
flag for addresses (<span class="italic">/p/</span> is for <span class="italic">/pointer/</span>!)):

<span class="org-meta-line">#+name: SIMPLE_C_PROGRAM</span>
<span class="org-block-begin-line">#+begin_src C +n -r
</span><span class="org-block-background">    </span><span class="keyword"><span class="org-block-background">for</span></span><span class="org-block-background">(</span><span class="type"><span class="org-block-background">int</span></span><span class="org-block-background"> </span><span class="variable-name"><span class="org-block-background">i</span></span><span class="org-block-background"> = 0; i &lt; 3; i++) {                   (ref:loop)
      printf(</span><span class="string"><span class="org-block-background">"Address \"%p\" holds \"%d\".\n"</span></span><span class="org-block-background">,     (ref:anal-mem)
              x_pointer + i, x_pointer[i]);        (ref:array-nota)
    }                                              (ref:end-loop)
</span><span class="org-block-end-line">#+end_src
</span>
This would print out as

<span class="org-block-begin-line">#+begin_example
</span><span class="org-block">Address "0xABCDEF00" holds "4".
Address "0xABCDEF04" holds "12".
Address "0xABCDEF08" holds "16".
</span><span class="org-block-end-line">#+end_example
</span>
And thus, we have finished the guts of the program.  What follows are
the necessary statements needed to make this a valid C program.

<span class="org-meta-line">#+name: SIMPLE_C_PROGRAM</span>
<span class="org-block-begin-line">#+begin_src C +n -r
</span><span class="org-block-background">    puts(</span><span class="string"><span class="org-block-background">"All done."</span></span><span class="org-block-background">);                             (ref:final-print)
    </span><span class="keyword"><span class="org-block-background">return</span></span><span class="org-block-background"> 0;
  }

  </span><span class="type"><span class="org-block-background">int</span></span><span class="org-block-background"> </span><span class="function-name"><span class="org-block-background">square</span></span><span class="org-block-background">(</span><span class="type"><span class="org-block-background">int</span></span><span class="org-block-background"> </span><span class="variable-name"><span class="org-block-background">a</span></span><span class="org-block-background">) {                              (ref:defun-square)
    </span><span class="keyword"><span class="org-block-background">return</span></span><span class="org-block-background"> a * a;
  }
</span><span class="org-block-end-line">#+end_src
</span>
And there you have it!  Remember everything you've learned so far;
it's important that you're comfortable with it before you can
implement what lies ahead...

- Functions and variables have memory addresses
- These addresses can be accessed using the address-of operator, <span class="org-verbatim">=&amp;=</span>
- Addresses are stored in pointers
- You can get the value stored at an address using the dereferencing
  operator, <span class="org-verbatim">=*=</span>

Know what is going on in these statements (there is not necessarily
any coherence within them):

<span class="org-block-begin-line">#+BEGIN_SRC C
</span><span class="type"><span class="org-block-background">int</span></span><span class="org-block-background"> *</span><span class="variable-name"><span class="org-block-background">p</span></span><span class="org-block-background"> = &amp;v;

</span><span class="type"><span class="org-block-background">char</span></span><span class="org-block-background"> *</span><span class="variable-name"><span class="org-block-background">s</span></span><span class="org-block-background"> = malloc(7 * </span><span class="keyword"><span class="org-block-background">sizeof</span></span><span class="org-block-background">(</span><span class="type"><span class="org-block-background">char</span></span><span class="org-block-background">));

</span><span class="type"><span class="org-block-background">void</span></span><span class="org-block-background"> (*</span><span class="function-name"><span class="org-block-background">fp</span></span><span class="org-block-background">)(</span><span class="type"><span class="org-block-background">void</span></span><span class="org-block-background">) = &amp;hi;

s[0] = </span><span class="string"><span class="org-block-background">'H'</span></span><span class="org-block-background">;
s[1] = </span><span class="string"><span class="org-block-background">'e'</span></span><span class="org-block-background">;
s[2] = </span><span class="string"><span class="org-block-background">'l'</span></span><span class="org-block-background">;
s[3] = </span><span class="string"><span class="org-block-background">'l'</span></span><span class="org-block-background">;
s[4] = </span><span class="string"><span class="org-block-background">'o'</span></span><span class="org-block-background">;
s[5] = </span><span class="string"><span class="org-block-background">'!'</span></span><span class="org-block-background">;
s[6] = </span><span class="string"><span class="org-block-background">'\0'</span></span><span class="org-block-background">;
</span><span class="org-block-end-line">#+END_SRC
</span>
A few extra things to note for the above:

- <span class="org-verbatim">=sizeof(T)=</span> is a special function that takes a type (such as <span class="org-verbatim">=int=</span>
  or <span class="org-verbatim">=struct MyStruct=</span>) and returns a <span class="org-verbatim">=sizet=</span> (a size-type; basically
  an <span class="org-verbatim">=unsigned int=</span>) of how many bytes it takes to store a complete
  variable of that type.  On 32-bit systems, for example, <span class="org-verbatim">=sizeof(int)
  = 4=</span>.
- <span class="org-verbatim">=malloc(sizet)=</span> is a function (included in <span class="org-verbatim">=stdlib.h=</span>) that returns
  an address that marks the beginning of a block of free memory.  Use
  of this function is <span class="italic">/always/</span> recommended, as it also protects the
  memory you ask for from being written over by another part of the
  program (it <span class="italic">/allocates/</span> the <span class="italic">/memory/</span> for you).
- Since there are no explicit bounds on `arrays' (since these are just
  pointers), there is no real way to `stop' an array.  Thus, since C
  strings are just arrays of characters, each string in C is ended by
  the null character, <span class="org-verbatim">=\0=</span>.  (C-strings are so-called
  <span class="italic">/null-terminated/</span> strings.)

A complete reference for all of these functions can be found at <span class="org-link"><a href="http://www.cplusplus.com/reference/">the
C++ Reference Page</a></span>.  It is an excellent and highly recommended
resource.
<span class="org-level-1">* Object Orientism</span>
You are just about ready to delve into object-oriented C.  From here
on out, there will be almost <span class="italic">/no immediately relevant code/</span> (at least
until after the project is due).  C is a language that is not
immediately well-suited for object-oriented techniques, however, a
firm understanding of <span class="italic">/exactly what object-orientism is/</span> will be
invaluable in your endeavors.  Let us begin.
<span class="org-level-2">** Objects?  What are Objects?</span>
What <span class="italic">/are/</span> objects?  Think back to your days of 120, where everything
was so simple and orderly.  You always knew exactly what was going to
happen at any given moment (or at least, looking back now you can).
Everything happened in order, exactly as you instructed.  You made
variables and <span class="org-verbatim">=for=</span> loops and <span class="org-verbatim">=while=</span> loops and all arrangements of
<span class="org-verbatim">=if=</span> statements, and you thought you reached the limits of what Java
could do.

This is pretty much what C is like at first glance.  While everything
can be done in the <span class="org-verbatim">=main=</span> function, it would be ugly and untenable --
impossible to manage or comprehend.  A lot of functionality would be
lost to you unless you <span class="italic">/really/</span> knew what you were doing with those
`pointer' things up there.  But in Java, you didn't stop at the <span class="org-verbatim">=main=</span>
function; you went on to create other functions inside the same file.
You went on to put variables, free from any function, inside that file
as well.  <span class="italic">/Then you even started using that entire file as a singly
entity from another file./</span>
