assets/s13-251-p1.org
** Methods for Models
This is the essence of object-orientism.  Going back to 120, what is
an object?  For example's sake, let's assume that in the previous
illustration, you created a =Person= class and a =Car= class, where
=Car= was using =Person=.  An object is often seen as the sum of its
parts:

- state :: Each variable in =Person= described what a =Person= could
           /be/.  Did the =Person= have brown hair or gray hair?  Did
           they have hair at all?  How long were their legs?  Where
           they long enough to reach the ground?  Each free-standing
           variable (the ones not included in functions (or /methods/,
           as they should now be called)) consistently and instantly
           described a particular quality of a =Person= unambiguously.
           Each =Person= object had the same types of qualities, but
           they did not have to be identical /in those/ qualities.  In
           short, objects /are/ things.
- behavior :: Since each /function/ in the file really described any
              =Person='s abilities, they are more appropriately
              described as /methods/ of the class.  Each =Person= had
              the same abilities and the same way for performing those
              abilities.  In short, objects can /do/ things.
- identity :: No two objects created via constructor are the same
              object.  Every object is mutually distinct from every
              other object unless one was explicitly instructed to
              copy another.

The possession of state and behavior are by far the most evident
qualities of what it is to be an object.  They are everything you
would write down in a class file in Java.  Each object has a set of
attributes according to a specific model, and each class has methods
that act on the models they were designed for.  In this way, it is
common to see the `model' and the `state of an object' to mean the
same thing -- and likewise with `methods' and `behavior'.
** Identity
So the first two were easy to understand, but the last may confuse you.
Consider the following example in Java, where the =Person= class
already exists:

#+BEGIN_SRC java
  Person a = new Person("John");
  Person b = new Person("John");
  
  if (a == b) {
      System.out.println("They have the same data,\n"
                       + "so they are the same object.");
  }
#+END_SRC

Would that printout occur?  Are the =Person= objects =a= and =b= equal
to each other?  They have the same name, but I'm sure you share your name
with another person you know.  Are you two then the same person?
Of course not!  =a= has an identity /apart from/ =b=.  =a!=b=.

So then, what does it mean for one object to be equal to another?
It's not sufficient that they have the same name; something else is
going on that Java's syntax is hiding from us.  Let's look at another
example.

#+BEGIN_SRC java
  Person a = new Person("John");
  Person b = a;

  if (a == b) {
      System.out.println("whee!");
  }
#+END_SRC

Will this print out?  (Hint: the constructor for =Person= was only
called once).  The written medium unfortunately cannot wait for an
answer; yes they will.  Only one =Person= object (=a=) was actually
created; =b= was simply assigned to equal whatever =a= equaled at the
time.  Does this remind you of anything?  Have we [[Double-Dipping][double-dipped]] into
the one =Person= object created?  What does this imply about =a= and
=b=?  /They're pointers?!?/

*Every object in Java is a pointer to a place in memory where the
object's data is held.*
