assets/s13-251-p1.org.html
<span class="org-level-2">** Methods for Models</span>
This is the essence of object-orientism.  Going back to 120, what is
an object?  For example's sake, let's assume that in the previous
illustration, you created a <span class="org-verbatim">=Person=</span> class and a <span class="org-verbatim">=Car=</span> class, where
<span class="org-verbatim">=Car=</span> was using <span class="org-verbatim">=Person=</span>.  An object is often seen as the sum of its
parts:

- <span class="org-list-dt">state ::</span> Each variable in <span class="org-verbatim">=Person=</span> described what a <span class="org-verbatim">=Person=</span> could
           <span class="italic">/be/</span>.  Did the <span class="org-verbatim">=Person=</span> have brown hair or gray hair?  Did
           they have hair at all?  How long were their legs?  Where
           they long enough to reach the ground?  Each free-standing
           variable (the ones not included in functions (or <span class="italic">/methods/</span>,
           as they should now be called)) consistently and instantly
           described a particular quality of a <span class="org-verbatim">=Person=</span> unambiguously.
           Each <span class="org-verbatim">=Person=</span> object had the same types of qualities, but
           they did not have to be identical <span class="italic">/in those/</span> qualities.  In
           short, objects <span class="italic">/are/</span> things.
- <span class="org-list-dt">behavior ::</span> Since each <span class="italic">/function/</span> in the file really described any
              <span class="org-verbatim">=Person=</span>'s abilities, they are more appropriately
              described as <span class="italic">/methods/</span> of the class.  Each <span class="org-verbatim">=Person=</span> had
              the same abilities and the same way for performing those
              abilities.  In short, objects can <span class="italic">/do/</span> things.
- <span class="org-list-dt">identity ::</span> No two objects created via constructor are the same
              object.  Every object is mutually distinct from every
              other object unless one was explicitly instructed to
              copy another.

The possession of state and behavior are by far the most evident
qualities of what it is to be an object.  They are everything you
would write down in a class file in Java.  Each object has a set of
attributes according to a specific model, and each class has methods
that act on the models they were designed for.  In this way, it is
common to see the `model' and the `state of an object' to mean the
same thing -- and likewise with `methods' and `behavior'.
<span class="org-level-2">** Identity</span>
So the first two were easy to understand, but the last may confuse you.
Consider the following example in Java, where the <span class="org-verbatim">=Person=</span> class
already exists:

<span class="org-block-begin-line">#+BEGIN_SRC java
</span><span class="org-block-background">  </span><span class="type"><span class="org-block-background">Person</span></span><span class="org-block-background"> </span><span class="variable-name"><span class="org-block-background">a</span></span><span class="org-block-background"> = </span><span class="keyword"><span class="org-block-background">new</span></span><span class="org-block-background"> </span><span class="type"><span class="org-block-background">Person</span></span><span class="org-block-background">(</span><span class="string"><span class="org-block-background">"John"</span></span><span class="org-block-background">);
  </span><span class="type"><span class="org-block-background">Person</span></span><span class="org-block-background"> </span><span class="variable-name"><span class="org-block-background">b</span></span><span class="org-block-background"> = </span><span class="keyword"><span class="org-block-background">new</span></span><span class="org-block-background"> </span><span class="type"><span class="org-block-background">Person</span></span><span class="org-block-background">(</span><span class="string"><span class="org-block-background">"John"</span></span><span class="org-block-background">);
  
  </span><span class="keyword"><span class="org-block-background">if</span></span><span class="org-block-background"> (a == b) {
      System.out.println(</span><span class="string"><span class="org-block-background">"They have the same data,\n"</span></span><span class="org-block-background">
                       + </span><span class="string"><span class="org-block-background">"so they are the same object."</span></span><span class="org-block-background">);
  }
</span><span class="org-block-end-line">#+END_SRC
</span>
Would that printout occur?  Are the <span class="org-verbatim">=Person=</span> objects <span class="org-verbatim">=a=</span> and <span class="org-verbatim">=b=</span> equal
to each other?  They have the same name, but I'm sure you share your name
with another person you know.  Are you two then the same person?
Of course not!  <span class="org-verbatim">=a=</span> has an identity <span class="italic">/apart from/</span> <span class="org-verbatim">=b=</span>.  <span class="org-verbatim">=a!=b=</span>.

So then, what does it mean for one object to be equal to another?
It's not sufficient that they have the same name; something else is
going on that Java's syntax is hiding from us.  Let's look at another
example.

<span class="org-block-begin-line">#+BEGIN_SRC java
</span><span class="org-block-background">  </span><span class="type"><span class="org-block-background">Person</span></span><span class="org-block-background"> </span><span class="variable-name"><span class="org-block-background">a</span></span><span class="org-block-background"> = </span><span class="keyword"><span class="org-block-background">new</span></span><span class="org-block-background"> </span><span class="type"><span class="org-block-background">Person</span></span><span class="org-block-background">(</span><span class="string"><span class="org-block-background">"John"</span></span><span class="org-block-background">);
  </span><span class="type"><span class="org-block-background">Person</span></span><span class="org-block-background"> </span><span class="variable-name"><span class="org-block-background">b</span></span><span class="org-block-background"> = a;

  </span><span class="keyword"><span class="org-block-background">if</span></span><span class="org-block-background"> (a == b) {
      System.out.println(</span><span class="string"><span class="org-block-background">"whee!"</span></span><span class="org-block-background">);
  }
</span><span class="org-block-end-line">#+END_SRC
</span>
Will this print out?  (Hint: the constructor for <span class="org-verbatim">=Person=</span> was only
called once).  The written medium unfortunately cannot wait for an
answer; yes they will.  Only one <span class="org-verbatim">=Person=</span> object (<span class="org-verbatim">=a=</span>) was actually
created; <span class="org-verbatim">=b=</span> was simply assigned to equal whatever <span class="org-verbatim">=a=</span> equaled at the
time.  Does this remind you of anything?  Have we <span class="org-link"><a href="Double-Dipping">double-dipped</a></span> into
the one <span class="org-verbatim">=Person=</span> object created?  What does this imply about <span class="org-verbatim">=a=</span> and
<span class="org-verbatim">=b=</span>?  <span class="italic">/They're pointers?!?/</span>

<span class="bold">*Every object in Java is a pointer to a place in memory where the
object's data is held.*</span>
