assets/s13-251-p1.org
* Conclusions and Hints
Let's review what we know about objects in general and what we have
observed from Java:

- A class defines two things:
  - a model of data that each member of the class will have unique to
    itself (/state/)
  - a collection of methods that are designed to operate on such
    models (/behavior/)
- An object in Java is merely a pointer to its data, the object's
  data may be copied, but to be an object is to be a reference to a
  specific point in memory (/identity/)

Let's review what we know about C:

- C has easy access to and manipulation of memory address through pointers
- C can define new types (structures[fn:3]) as compositions of base
  types (=int=, =char=, /pointers/, etc.)[fn:4]
- C can have pointers to functions that, for all intents and purposes,
  mostly act like regular variables.

How can you apply what you know about structures, pointers, and
object-orientism to complete this project?  Let's review the
requirements:

- To get an 85 :: A "class" that includes fields and functions; a
                  piece of demonstration code with a full class
                  implementation of something simple (Rectangle,
                  Student, etc.).

You already know how to do this.  (In fact, if you've read this entire
document, you already know how to get a 100.)  What is a class?  A
class has /state/ (a model of data) and /behavior/ (a collection of
methods to work with that data).  If you're having trouble figuring
out how you're going to make many data come as a single entity, you
may want to check out the =struct= again.  This one isn't too fancy.

- To get a 90 :: Add "instantiation".  This would include multiple
                 constructors.  An extra 5 points if you handle
                 multiple constructors as functions with the same name
                 but different number of parameters.

What is a constructor but something that prepares the house and hands
you a key?  Metaphors, man.  (Confucius says: "the key to your
understanding is /pointers/.")

- To get a 100 :: Add "object" variables to classes.  This will
                  require you to create two classes, and have one
                  inside of the other (for instance a Point object
                  inside of a Shape class).

This one is dead simple.  What are objects but keys to a house?

- To get a 110 :: Add public and private scope

You might want to have a public (hint: =static=) key and a private
key.  And you thought get/set methods were completely useless!

Or perhaps you'd fancy a global, omniscient, sentient key-chain?

- To get a 120 :: Add inheritance. (no hints from the instructor or
                  TAs here)

I am neither the instructor nor a TA, but I still find it fun to say
'it sucks to be you.'

However, I will point you to an invaluable resource that is available
[[http://www.cs.rit.edu/~ats/books/ooc.pdf][here]].  Inside, Schreiner describes a quite different (but much more
versatile and consequently a little more advanced) practical approach
to object-oriented C.  There really is /very little/ to the syntax of
C, and it is consistent.  With a firm knowledge of C's syntax (and the
humility to Google what you don't know), I have complete confidence
that you'll be able to understand it (since it's really not all that
complex).  Who knows?  If you can manage to write your own =ooc=
preprocessor as Schreiner describes, this project can become very,
very easy.  I mean, nobody has told you to write =ooc= in C, have
they?

Good luck, folks.
* Footnotes
[fn:1] There are several steps to build a C program.  The program is
compiled, assembled, and then linked.  The linker is what associates
definitions with calls.

[fn:2] This is often shortened =int*=, but there are problems with
this, to be discussed later.

[fn:3] C has =structs= that effectively define new types.  They are
assumed knowledge for this document, but you can find out more about
them over at the reference pages.

[fn:4] Hint: pointers can point to either functions or variables /of any type/.
* Endnotes
This document was written using Emacs' =org-mode=.  The source is
available [[http://localhost:4000/assets/s13-251-p1.org.html][here]] for reference.
