assets/s13-251-p1.org.html
<span class="org-level-1">* Conclusions and Hints</span>
Let's review what we know about objects in general and what we have
observed from Java:

- A class defines two things:
  - a model of data that each member of the class will have unique to
    itself (<span class="italic">/state/</span>)
  - a collection of methods that are designed to operate on such
    models (<span class="italic">/behavior/</span>)
- An object in Java is merely a pointer to its data, the object's
  data may be copied, but to be an object is to be a reference to a
  specific point in memory (<span class="italic">/identity/</span>)

Let's review what we know about C:

- C has easy access to and manipulation of memory address through pointers
- C can define new types (structures<span class="org-footnote">[fn:3]</span>) as compositions of base
  types (<span class="org-verbatim">=int=</span>, <span class="org-verbatim">=char=</span>, <span class="italic">/pointers/</span>, etc.)<span class="org-footnote">[fn:4]</span>
- C can have pointers to functions that, for all intents and purposes,
  mostly act like regular variables.

How can you apply what you know about structures, pointers, and
object-orientism to complete this project?  Let's review the
requirements:

- <span class="org-list-dt">To get an 85 ::</span> A "class" that includes fields and functions; a
                  piece of demonstration code with a full class
                  implementation of something simple (Rectangle,
                  Student, etc.).

You already know how to do this.  (In fact, if you've read this entire
document, you already know how to get a 100.)  What is a class?  A
class has <span class="italic">/state/</span> (a model of data) and <span class="italic">/behavior/</span> (a collection of
methods to work with that data).  If you're having trouble figuring
out how you're going to make many data come as a single entity, you
may want to check out the <span class="org-verbatim">=struct=</span> again.  This one isn't too fancy.

- <span class="org-list-dt">To get a 90 ::</span> Add "instantiation".  This would include multiple
                 constructors.  An extra 5 points if you handle
                 multiple constructors as functions with the same name
                 but different number of parameters.

What is a constructor but something that prepares the house and hands
you a key?  Metaphors, man.  (Confucius says: "the key to your
understanding is <span class="italic">/pointers/</span>.")

- <span class="org-list-dt">To get a 100 ::</span> Add "object" variables to classes.  This will
                  require you to create two classes, and have one
                  inside of the other (for instance a Point object
                  inside of a Shape class).

This one is dead simple.  What are objects but keys to a house?

- <span class="org-list-dt">To get a 110 ::</span> Add public and private scope

You might want to have a public (hint: <span class="org-verbatim">=static=</span>) key and a private
key.  And you thought get/set methods were completely useless!

Or perhaps you'd fancy a global, omniscient, sentient key-chain?

- <span class="org-list-dt">To get a 120 ::</span> Add inheritance. (no hints from the instructor or
                  TAs here)

I am neither the instructor nor a TA, but I still find it fun to say
'it sucks to be you.'

However, I will point you to an invaluable resource that is available
<span class="org-link"><a href="http://www.cs.rit.edu/~ats/books/ooc.pdf">here</a></span>.  Inside, Schreiner describes a quite different (but much more
versatile and consequently a little more advanced) practical approach
to object-oriented C.  There really is <span class="italic">/very little/</span> to the syntax of
C, and it is consistent.  With a firm knowledge of C's syntax (and the
humility to Google what you don't know), I have complete confidence
that you'll be able to understand it (since it's really not all that
complex).  Who knows?  If you can manage to write your own <span class="org-verbatim">=ooc=</span>
preprocessor as Schreiner describes, this project can become very,
very easy.  I mean, nobody has told you to write <span class="org-verbatim">=ooc=</span> in C, have
they?

Good luck, folks.
<span class="org-level-1">* Footnotes</span>
<span class="org-footnote">[fn:1]</span> There are several steps to build a C program.  The program is
compiled, assembled, and then linked.  The linker is what associates
definitions with calls.

<span class="org-footnote">[fn:2]</span> This is often shortened <span class="org-verbatim">=int*=</span>, but there are problems with
this, to be discussed later.

<span class="org-footnote">[fn:3]</span> C has <span class="org-verbatim">=structs=</span> that effectively define new types.  They are
assumed knowledge for this document, but you can find out more about
them over at the reference pages.

<span class="org-footnote">[fn:4]</span> Hint: pointers can point to either functions or variables <span class="italic">/of any type/</span>.
<span class="org-level-1">* Endnotes</span>
This document was written using Emacs' <span class="org-verbatim">=org-mode=</span>.  The source is
available <span class="org-link"><a href="http://localhost:4000/assets/s13-251-p1.org.html">here</a></span> for reference.
</pre>
  </body>
</html>
